mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xj/s6e2c5xj.svd
        <!-- REGISTER "IRQ083MON" -->
        <register>
          <name>IRQ083MON</name>
          <description>IRQ083 Batch Read Register [BHW]</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ084MON" -->
        <register>
          <name>IRQ084MON</name>
          <description>IRQ084 Batch Read Register [BHW]</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ085MON" -->
        <register>
          <name>IRQ085MON</name>
          <description>IRQ085 Batch Read Register [BHW]</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ086MON" -->
        <register>
          <name>IRQ086MON</name>
          <description>IRQ086 Batch Read Register [BHW]</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ087MON" -->
        <register>
          <name>IRQ087MON</name>
          <description>IRQ087 Batch Read Register [BHW]</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ088MON" -->
        <register>
          <name>IRQ088MON</name>
          <description>IRQ088 Batch Read Register [BHW]</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.5</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ089MON" -->
        <register>
          <name>IRQ089MON</name>
          <description>IRQ089 Batch Read Register [BHW]</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ090MON" -->
        <register>
          <name>IRQ090MON</name>
          <description>IRQ090 Batch Read Register [BHW]</description>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMACINT" -->
            <field>
              <name>DMACINT</name>
              <description>Interrupt request of the DMAC ch.7</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ091MON" -->
        <register>
          <name>IRQ091MON</name>
          <description>IRQ091 Batch Read Register [BHW]</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSTCINT1" -->
            <field>
              <name>DSTCINT1</name>
              <description>DSTC ERINT interrupt request</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DSTCINT0" -->
            <field>
              <name>DSTCINT0</name>
              <description>DSTC SWINT interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ092MON" -->
        <register>
          <name>IRQ092MON</name>
          <description>IRQ092 Batch Read Register [BHW]</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description>Interrupt request of the external pin interrupt ch.19</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description>Interrupt request of the external pin interrupt ch.18</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description>Interrupt request of the external pin interrupt ch.17</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description>Interrupt request of the external pin interrupt ch.16</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ093MON" -->
        <register>
          <name>IRQ093MON</name>
          <description>IRQ093 Batch Read Register [BHW]</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description>Interrupt request of the external pin interrupt ch.23</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description>Interrupt request of the external pin interrupt ch.22</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description>Interrupt request of the external pin interrupt ch.21</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description>Interrupt request of the external pin interrupt ch.20</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ094MON" -->
        <register>
          <name>IRQ094MON</name>
          <description>IRQ094 Batch Read Register [BHW]</description>
          <addressOffset>0x37C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description>Interrupt request of the external pin interrupt ch.27</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description>Interrupt request of the external pin interrupt ch.26</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description>Interrupt request of the external pin interrupt ch.25</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description>Interrupt request of the external pin interrupt ch.24</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
