mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xj/s6e2c5xj.svd
        <!-- REGISTER "CSIO_SCSTR32" -->
        <register>
          <name>CSIO_SCSTR32</name>
          <description>Serial Chip Select Timing Registers 2/3 [BHW]</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSDS" -->
            <field>
              <name>CSDS</name>
              <description>Serial Chip Deselect bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SACSR" -->
        <register>
          <name>CSIO_SACSR</name>
          <description>Serial Support Control Register [BHW]</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x39DF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TBEEN" -->
            <field>
              <name>TBEEN</name>
              <description>Transfer Byte Error Enable bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEIE" -->
            <field>
              <name>CSEIE</name>
              <description>Chip Select Error Interupt Enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSE" -->
            <field>
              <name>CSE</name>
              <description>Chip Select Error Flag</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TINT" -->
            <field>
              <name>TINT</name>
              <description>Timer Interrupt Flag</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TINTE" -->
            <field>
              <name>TINTE</name>
              <description>Timer Interrupt Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSYNE" -->
            <field>
              <name>TSYNE</name>
              <description>Synchronous Transmission Enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDIV" -->
            <field>
              <name>TDIV</name>
              <description>Timer Operation Clock Division bit</description>
              <msb>4</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMRE" -->
            <field>
              <name>TMRE</name>
              <description>Serial Timer Enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_STMR" -->
        <register>
          <name>CSIO_STMR</name>
          <description>Serial Timer Register [BHW]</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM" -->
            <field>
              <name>TM</name>
              <description>Timer Data bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_STMCR" -->
        <register>
          <name>CSIO_STMCR</name>
          <description>Serial Timer Comparison Register [BHW]</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description>Compare bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSCR" -->
        <register>
          <name>CSIO_SCSCR</name>
          <description>Serial Chip Select Control Status Register [BHW]</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0020</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SST" -->
            <field>
              <name>SST</name>
              <description>Serial Chip Select Active Start bit</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SED" -->
            <field>
              <name>SED</name>
              <description>Serial Chip Select Active End bit</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCD" -->
            <field>
              <name>SCD</name>
              <description>Serial Chip Select Active Display bit</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCAM" -->
            <field>
              <name>SCAM</name>
              <description>Serial Chip Select Active Hold bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDIV" -->
            <field>
              <name>CDIV</name>
              <description>Serial Chip Select Timing Operation Clock Division bit</description>
              <msb>8</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSLVL" -->
            <field>
              <name>CSLVL</name>
              <description>Serial Chip Select Level Setting bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN3" -->
            <field>
              <name>CSEN3</name>
              <description>Serial Chip Select Enable bit with SCS3 pin</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN2" -->
            <field>
              <name>CSEN2</name>
              <description>Serial Chip Select Enable bit with SCS2 pin</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN1" -->
            <field>
              <name>CSEN1</name>
              <description>Serial Chip Select Enable bit with SCS1 pin</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN0" -->
            <field>
              <name>CSEN0</name>
              <description>Serial Chip Select Enable bit with SCS0 pin</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSOE" -->
            <field>
              <name>CSOE</name>
              <description>Serial Chip Select Output Enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSFR0" -->
        <register>
          <name>CSIO_SCSFR0</name>
          <description>Serial Chip Select Format Register 0 [BHW]</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CS1CSLVL" -->
            <field>
              <name>CS1CSLVL</name>
              <description>Serial Chip Select 1 Level Setting bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1SCINV" -->
            <field>
              <name>CS1SCINV</name>
              <description>Serial Clock Invert bit of Serial Chip Select 1</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1SPI" -->
            <field>
              <name>CS1SPI</name>
              <description>SPI corresponding bit of Serial Chip Select 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1L" -->
            <field>
              <name>CS1L</name>
              <description>Transfer direction select bit of Serial Chip Select 1</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
